{
    "name": "Jyotikanta Nadi",
    "role": "Software Engineer",
    "objective": "To work in a challenging environment, where I can utilize my potential and innovative competence to achieve personal and professional goals. Adaptive and willing to work with emerging technologies.",
    "xsummary": "Innovative Web Developer with 2 years of experience in Angular and Reactjs. Demonstrated talent for front and back-end web development to optimize online presence. Seasoned expert in languages such as HTML, BootStrap,JQuery,D3Js as well as scripting languages Typescript,ECMAScript and JavaScript.",
    "xprofessionalsummary": "Web Developer specializing in front end development. Experienced with all stages of the development cycle for dynamic web projects. Well-versed in numerous programming languages including AngularJS, ReactJS,NodeJS, HTML5, JavaScript, CSS, MongoDB. Strong background in project management. ",
    "professionalsummary": "A dedicated professional with 2+ year experience. Specializes in Developing and Maintaining Angular2+/ReactJS/NextJS projects from scratch following industry standards with all stages of the development cycle for dynamic web projects. Well-versed in numerous programming languages including JavaScript, Typescript and Java. Strong background in project management. ",
    "yprofessionalsummary": "A dedicated professional with 2+ year experience. Specializes in Developing and Maintaining Angular2+/ReactJS/NextJS projects from scratch following industry standards. Now seeking to contribute my experience, skills and expertise to Development Team for social welfare.",
    "contact_info": {
        "address": "Bangalore, KA, 560068",
        "phone": 8270820320,
        "email": "Sanjay.row.com@gmail.com",
        "socialLinks": [
            {
                "name": "LinkedIn",
                "link": "https://in.linkedin.com/in/jyotikantanadi",
                "link_name": "in.linkedin.com/in/ jyotikantanadi"
            },
            {
                "name": "Skype",
                "link": "skype:Jyotikanta9010? userinfo",
                "link_name": "Jyotikanta9010"
            }
        ]
    },
    "workHistory": [
        {
            "isBulletPoint": "false",
            "employer": "Healthsignz Pvt. Ltd",
            "job_title": "Software Engineer Trainee",
            "city": "Bangalore",
            "state": "Karnataka",
            "startDate": "06/2018",
            "endDate": "Current",
            "responsibiltyList": [
                "Angular and ReactJS Based UI Devlopements.",
                "Planned and engineered RESTful web services to manipulate dynamic datasets and Integrating With Javascript UI Frameworks (Angular & ReactJS).",
                "Integrating Charts and Graphs Using D3JS.",
                "Integrating Google Map Functionalities.",
                "Building reusable components and front-end libraries for future use.",
                "Maintain and Improvement In Existing Portals.",
                "Optimize And Enhance of Application For Maximise process and User Experience.",
                "Bug Fixes According to Required Functionality and Designs.",
                "Tested websites and performed troubleshooting prior to deployment.",
                "Researched new technologies, software packages and hardware products for use in website projects."
            ]
        }
    ],
    "career_summary": [
        "Having 2+ year of experience as Software Developer",
        "Hands on Experience in Developing and maintaining Angular2+/ReactJS/NextJS projects from scratch following industry standards.",
        "Hands on Experience in Developing User Friendly and Mobile-First UI using HTML5, CSS3, BootStrap4, JQuery and JavaScript.",
        "Experience in Developing Responsive Design using BootStrap4 and materialize.",
        "Experience in Integrating 3rd Party Plugins and Library Like Chart.js, D3JS, Google maps",
        "Experience in writing widgets for Angular2+ & ReactJS.",
        "Knowledge in Agile Methodology (JIRA)."
    ],
    "indivisual_projects": [
        "Dynamic College WebSite Using Angular, Java and MySQL as Final Semister Major Project, It Includes Library Management, Hostel Bed Allotment, Notice And Event Management.",
        "Pure Javadcript and Jquery Based Invoice Generation And Printing .",
        "Solved 250 Mathmetical Problem Using Java From projecteuler.net (With team Of 5Memb) As Minor Project"
    ],
    "education": [
        {
            "college_name": "KMBB CET (BPUT)",
            "location": "Daleiput,Khordha",
            "degree": "Bachelor of Technology",
            "field": "Computer Science and Engineering",
            "start_date": "08/2013",
            "end_date": "05/2017"
        }
    ],
    "skill": [
        {
            "name": "Javascript"
        },
        {
            "name": "Angular"
        },
        {
            "name": "ReactJs"
        },
        {
            "name": "HTML"
        },
        {
            "name": "CSS"
        },
        {
            "name": "Core Java"
        },
        {
            "name": "Nodejs (Basics)"
        },
        {
            "name": "MongoDB (Basics)"
        },
        {
            "name": "SQL (Basics)"
        },
        {
            "name": " ",
            "rating": null
        }
    ],
    "awards": [
        "Awarded Star-Of-The-Month Employee",
        "Winner in C Debugging On Graduation Tech Fest"
    ],
    "language": [
        "English",
        "Hindi",
        "Odia"
    ]
}